# ðŸ“˜ Assignment Demo in Jupyter Notebook
This notebook demonstrates how to handle a CSV file, display an image, and open a YouTube link.

## âœ… 1. Load and Manipulate CSV Data

In [3]:
import pandas as pd

# Load the CSV file (place 'sample_data.csv' in the same directory)
df = pd.read_csv("sample_data.csv")
df.head(10)

      Name  Age Gender  Salary
0    Alice   25      F   50000
1      Bob   30      M   60000
2  Charlie   35      M   55000
3    David   40      M   70000
4      Eve   22      F   48000
5    Frank   33      M   62000
6    Grace   28      F   51000
7   Hannah   36      F   68000
8      Ian   29      M   58000
9     Jane   41      F   72000

In [4]:
# Show columns
df.columns

Index(['Name', 'Age', 'Gender', 'Salary'], dtype='object')

In [5]:
# Show data types
df.dtypes

Name      object
Age        int64
Gender    object
Salary     int64
dtype: object

In [6]:
# Show shape
df.shape

(10, 4)

In [7]:
# Show size
df.size

40

In [8]:
# Describe data
df.describe()

             Age        Salary
count  10.000000     10.000000
mean   31.900000  59400.000000
std     6.226288   8579.044236
min    22.000000  48000.000000
25%    28.250000  52000.000000
50%    31.500000  59000.000000
75%    35.750000  66500.000000
max    41.000000  72000.000000

In [ ]:
# Rename column 'Salary' to 'Monthly_Salary'
df.rename(columns={'Salary': 'Monthly_Salary'}, inplace=True)

In [ ]:
# Delete 'Gender' column
df.drop('Gender', axis=1, inplace=True)

In [ ]:
# Delete row at index 3
df.drop(3, axis=0, inplace=True)

In [ ]:
# Check for null values
df.isnull()

In [ ]:
# Count null values
df.isnull().sum()

## âœ… 2. Display an Image

In [1]:
from IPython.display import Image, display

# Display image from web URL
display(Image(url="https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/2048px-React-icon.svg.png", width=300))

## âœ… 3. Open YouTube Link from User Input

In [1]:
import webbrowser

link = input("Enter a YouTube video URL: ")
webbrowser.open(link)

Enter a YouTube video URL:  https://www.youtube.com/watch?v=dQw4w9WgXcQ

True